IDEA StatiCa Open Model
PatchSupport Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of patch support in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.PatchDevice
 IdeaRS.OpenModel.Detail.PatchSupport
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PatchSupport : PatchDevice
Public Class PatchSupport
	Inherits PatchDevice
public ref class PatchSupport : public PatchDevice
The PatchSupport type exposes the following members.
Constructors
Name | Description
PatchSupport
 Constructor
Top
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
 (Inherited from PatchDevice.)
Id
 Element Id
 (Inherited from OpenElementId.)
MasterComponent
 Master component
 (Inherited from PatchDevice.)
MasterPoint
 Master point 0 - 9
 (Inherited from PatchDevice.)
Position
 Offset between MasterPoint and patch support/load
 (Inherited from PatchDevice.)
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace